logs/fio-diskseq/Strato 4v 8GB/000/log001.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;522199;2039;32128;0;0;0.000000;0.000000;67;228264;482.752779;2360.625245;1.000000%=69;5.000000%=70;10.000000%=71;20.000000%=73;30.000000%=76;40.000000%=81;50.000000%=85;60.000000%=89;70.000000%=99;80.000000%=114;90.000000%=134;95.000000%=166;99.000000%=10682;99.500000%=14352;99.900000%=14614;99.950000%=14745;99.990000%=17956;0%=0;0%=0;0%=0;68;228271;484.678315;2360.605420;356864;1725440;100.000000%;522682.671875;173886.262861;0.280138%;20.313132%;2353;0;14;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;69.92%;26.44%;0.08%;0.00%;0.00%;0.00%;0.01%;2.23%;1.32%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;12511;0;15;0;1464814;1464816;97.91%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3340: Mon Jan  8 13:59:33 2024
  write: IOPS=2039, BW=510MiB/s (535MB/s)(16.0GiB/32128msec); 0 zone resets
    clat (usec): min=67, max=228264, avg=482.75, stdev=2360.63
     lat (usec): min=68, max=228271, avg=484.68, stdev=2360.61
    clat percentiles (usec):
     |  1.00th=[   70],  5.00th=[   71], 10.00th=[   72], 20.00th=[   74],
     | 30.00th=[   77], 40.00th=[   82], 50.00th=[   86], 60.00th=[   90],
     | 70.00th=[  100], 80.00th=[  115], 90.00th=[  135], 95.00th=[  167],
     | 99.00th=[10683], 99.50th=[14353], 99.90th=[14615], 99.95th=[14746],
     | 99.99th=[17957]
   bw (  KiB/s): min=356864, max=1725440, per=100.00%, avg=522682.67, stdev=173886.26, samples=64
   iops        : min= 1394, max= 6740, avg=2041.72, stdev=679.25, samples=64
  lat (usec)   : 100=69.92%, 250=26.44%, 500=0.08%
  lat (msec)   : 4=0.01%, 10=2.23%, 20=1.32%, 50=0.01%, 250=0.01%
  cpu          : usr=0.28%, sys=20.31%, ctx=2353, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=510MiB/s (535MB/s), 510MiB/s-510MiB/s (535MB/s-535MB/s), io=16.0GiB (17.2GB), run=32128-32128msec

Disk stats (read/write):
  vda: ios=0/12511, merge=0/15, ticks=0/1464814, in_queue=1464816, util=97.91%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;485409;1896;34563;0;0;0.000000;0.000000;57;3413;521.578574;74.652968;1.000000%=321;5.000000%=440;10.000000%=456;20.000000%=485;30.000000%=505;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=561;90.000000%=585;95.000000%=602;99.000000%=667;99.500000%=716;99.900000%=1155;99.950000%=1581;99.990000%=2310;0%=0;0%=0;0%=0;57;3413;521.693267;74.649566;291328;488960;100.000000%;485776.695652;23754.403054;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.298015%;16.549968%;65430;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.25%;0.47%;26.76%;72.15%;0.21%;0.12%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65206;1013;0;1;62903;65367;128270;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3343: Mon Jan  8 14:00:07 2024
  read: IOPS=1896, BW=474MiB/s (497MB/s)(16.0GiB/34563msec)
    clat (usec): min=57, max=3413, avg=521.58, stdev=74.65
     lat (usec): min=57, max=3413, avg=521.69, stdev=74.65
    clat percentiles (usec):
     |  1.00th=[  322],  5.00th=[  441], 10.00th=[  457], 20.00th=[  486],
     | 30.00th=[  506], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  562], 90.00th=[  586], 95.00th=[  603],
     | 99.00th=[  668], 99.50th=[  717], 99.90th=[ 1156], 99.95th=[ 1582],
     | 99.99th=[ 2311]
   bw (  KiB/s): min=291328, max=488960, per=100.00%, avg=485776.70, stdev=23754.40, samples=69
   iops        : min= 1138, max= 1910, avg=1897.57, stdev=92.79, samples=69
  lat (usec)   : 100=0.25%, 250=0.47%, 500=26.76%, 750=72.15%, 1000=0.21%
  lat (msec)   : 2=0.12%, 4=0.02%
  cpu          : usr=0.30%, sys=16.55%, ctx=65430, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=474MiB/s (497MB/s), 474MiB/s-474MiB/s (497MB/s-497MB/s), io=16.0GiB (17.2GB), run=34563-34563msec

Disk stats (read/write):
  vda: ios=65206/1013, merge=0/1, ticks=62903/65367, in_queue=128270, util=100.00%