logs/fio-diskseq/Strato 4v 8GB/000/log005.txt
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=16G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;16777216;521371;2036;32179;0;0;0.000000;0.000000;65;211971;483.039861;2429.423727;1.000000%=70;5.000000%=71;10.000000%=72;20.000000%=74;30.000000%=77;40.000000%=82;50.000000%=87;60.000000%=92;70.000000%=107;80.000000%=116;90.000000%=134;95.000000%=162;99.000000%=13434;99.500000%=14221;99.900000%=14614;99.950000%=14614;99.990000%=14876;0%=0;0%=0;0%=0;67;211978;484.975139;2429.408854;311808;1971712;100.000000%;521904.000000;195820.352827;0.441295%;20.666294%;2292;0;14;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;65.68%;30.76%;0.09%;0.01%;0.01%;0.00%;0.01%;1.81%;1.63%;0.01%;0.00%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;0;12998;0;21;0;1468998;1469002;97.72%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=3414: Mon Jan  8 14:04:41 2024
  write: IOPS=2036, BW=509MiB/s (534MB/s)(16.0GiB/32179msec); 0 zone resets
    clat (usec): min=65, max=211971, avg=483.04, stdev=2429.42
     lat (usec): min=67, max=211978, avg=484.98, stdev=2429.41
    clat percentiles (usec):
     |  1.00th=[   71],  5.00th=[   72], 10.00th=[   73], 20.00th=[   75],
     | 30.00th=[   78], 40.00th=[   83], 50.00th=[   88], 60.00th=[   93],
     | 70.00th=[  108], 80.00th=[  117], 90.00th=[  135], 95.00th=[  163],
     | 99.00th=[13435], 99.50th=[14222], 99.90th=[14615], 99.95th=[14615],
     | 99.99th=[14877]
   bw (  KiB/s): min=311808, max=1971712, per=100.00%, avg=521904.00, stdev=195820.35, samples=64
   iops        : min= 1218, max= 7702, avg=2038.69, stdev=764.92, samples=64
  lat (usec)   : 100=65.68%, 250=30.76%, 500=0.09%, 750=0.01%, 1000=0.01%
  lat (msec)   : 4=0.01%, 10=1.81%, 20=1.63%, 50=0.01%, 250=0.01%
  cpu          : usr=0.44%, sys=20.67%, ctx=2292, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=509MiB/s (534MB/s), 509MiB/s-509MiB/s (534MB/s-534MB/s), io=16.0GiB (17.2GB), run=32179-32179msec

Disk stats (read/write):
  vda: ios=0/12998, merge=0/21, ticks=0/1468998, in_queue=1469002, util=97.72%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=16G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
3;fio-3.28;kube-fio-read;0;0;16777216;484946;1894;34596;0;0;0.000000;0.000000;64;3891;521.555201;76.876278;1.000000%=292;5.000000%=436;10.000000%=456;20.000000%=481;30.000000%=501;40.000000%=514;50.000000%=522;60.000000%=528;70.000000%=544;80.000000%=561;90.000000%=585;95.000000%=602;99.000000%=684;99.500000%=741;99.900000%=1253;99.950000%=1515;99.990000%=2088;0%=0;0%=0;0%=0;64;3891;521.686255;76.872108;258560;488960;100.000000%;485264.695652;27694.374294;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.407573%;16.846365%;65367;0;75;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.26%;0.56%;27.19%;71.54%;0.26%;0.18%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;vda;65132;1082;0;3;62762;62908;125671;100.00%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=3417: Mon Jan  8 14:05:16 2024
  read: IOPS=1894, BW=474MiB/s (497MB/s)(16.0GiB/34596msec)
    clat (usec): min=64, max=3891, avg=521.56, stdev=76.88
     lat (usec): min=64, max=3891, avg=521.69, stdev=76.87
    clat percentiles (usec):
     |  1.00th=[  293],  5.00th=[  437], 10.00th=[  457], 20.00th=[  482],
     | 30.00th=[  502], 40.00th=[  515], 50.00th=[  523], 60.00th=[  529],
     | 70.00th=[  545], 80.00th=[  562], 90.00th=[  586], 95.00th=[  603],
     | 99.00th=[  685], 99.50th=[  742], 99.90th=[ 1254], 99.95th=[ 1516],
     | 99.99th=[ 2089]
   bw (  KiB/s): min=258560, max=488960, per=100.00%, avg=485264.70, stdev=27694.37, samples=69
   iops        : min= 1010, max= 1910, avg=1895.57, stdev=108.18, samples=69
  lat (usec)   : 100=0.26%, 250=0.56%, 500=27.19%, 750=71.54%, 1000=0.26%
  lat (msec)   : 2=0.18%, 4=0.01%
  cpu          : usr=0.41%, sys=16.85%, ctx=65367, majf=0, minf=75
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65536,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=474MiB/s (497MB/s), 474MiB/s-474MiB/s (497MB/s-497MB/s), io=16.0GiB (17.2GB), run=34596-34596msec

Disk stats (read/write):
  vda: ios=65132/1082, merge=0/3, ticks=62762/62908, in_queue=125671, util=100.00%